{
  "basics": {
    "name": "Kangsheng(\"Hurley\") Qi",
    "image": "",
    "email": "hurleyqi@utexas.edu",
    "phone": "(713) 501-9426",
    "url": "https://hurleyqi.github.io/",
    "summary": "Motivated and highly skilled candidate with Bachelor's degrees in Computer Science and Mathematics, and strong foundation and research experience in computer science and computational biology. Experienced in machine learning, bioinformatics, and data analysis. Eager to pursue a Ph.D. to further investigate the intersections of biology, computer science, and mathematics",
    "profiles": [
      {
        "network": "Twitter",
        "username": "AlbertEinstein",
        "url": "https://twitter.com/AlbertEinstein"
      }
    ]
  },
  "work": [
    {
      "name": "The Oden Institute for Computational Engineering and Sciences, UT Austin",
      "position": "Student Associate",
      "startDate": "2023-09",
      "endDate": "Present",
      "summary": [
        "Conduct interviews with distinguished faculty members on advanced multidisciplinary research projects",
        "Assist graduate students with administrative tasks, including on boarding, coordinating project activities, and others", 
        "Organize events featuring distinguished speakers, handling logistics such as venue arrangements and promotional activities"
      ]
    }, 
    {
      "name": "PHYZ Lab, UT Austin",
      "position": "Undergraduate Research Intern",
      "startDate": "2024-06",
      "endDate": "Present",
      "summary": [
        "Utilized chaos theory, time series analysis, deep learning, neural networks, and mathematical modeling to predict NICU patient health patterns, septic rates, and discharge times. This work, supervised by Dr. Joshua Chang, aimed to enhance medical treatment applications and support healthcare professionals",
        "Collaborated with medical professionals, clinicians, and distinguished researchers to understand and provide feedback on various projects, including electroceuticals, gait analysis, and delirium forecasting"
      ]
    },
    {
      "name": "Dr. Can Cenik Lab, UT Austin",
      "position": "Undergraduate Research Assistant",
      "startDate": "2024-01",
      "endDate": "Present",
      "summary": [
        "Investigate translation efficiency on C. Elegans genes utilizing in-lab softwares",
        "Develop advanced methods for functional prediction based on translation efficiency calculations",
        "Predict novel gene function for C. Elegans genes based and obtained validation from collaborators"
      ]
    }, 
    {
      "name": "Dr. Stephen Yi Lab, UT Austin",
      "position": "Undergraduate Research Assistant",
      "startDate": "2023-12",
      "endDate": "2024-05",
      "summary": [
        "Conducted research focused on enhancer motif analysis and DNA functional prediction utilizing machine learning, concurrency, and other computational biology techniques",
        "Contributed to the curation of a comprehensive antibody/antigen mutation dataset "
      ]
    }, 
    {
      "name": "Department of Mathematics, UT Austin",
      "position": "Undergraduate Course Assistant",
      "startDate": "2023-08",
      "endDate": "2023-12",
      "summary": [
        "Collaborated with instructors on grading criteria, provided constructive feedback to students",
        "Managed unforeseen challenges, including student medical emergencies and miscommunications, to ensure the smooth flow of the course"
      ]
    }
  ],
  "publications": [
    {
      "name": "Himanshu Reddy, Kangsheng Qi, Michael Zeosky, S. Stephen Yi. Understanding the Parallelizability of Gibbs Sampling for DNA Motif Finding. Status: Under Review at Computational and Structural Biology"
    }
  ],
  "education": [
    {
      "institution": "The University of Texas at Austin",
      "location": "Austin, USA",
      "url": "https://www.utexas.edu/",
      "area": "Computer Science, Mathematics",
      "studyType": "Bachelor's Degree",
      "startDate": "2022-08",
      "endDate": "2025-05",
      "score": "10"
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python",
        "Java",
        "C/C++",
        "R",
        "MATLAB"
      ]
    },
    {
      "name": "Hard skills",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Biology Sequence Analysis",
        "Gene Functional Prediction",
        " Biological Modeling",
        "Machine Learning",
        "High Performance Computing"
      ]
    }
  ],
  "languages": [
    {
      "language": "Mandarin",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "interests": [
    {
      "name": "Computer Science",
      "keywords": [
        "Computational Biology",
        "Computational Medicine",
        "Machine Learning",
        "Artificial Intelligence",
        "High Performance Computing"
      ]
    }
  ],
  "projects": [
    {
      "name": "Understanding the Parallelizability of Gibbs Sampling for DNA Motif Finding (Paper in Review)",
      "highlights": [
        "Investigated the impact of CUDA parallelizability on parameters and efficiency of Gibbs Sampling motif finding"
      ],
      "startDate": "2024-02",
      "endDate": "Present"
    },
    {
      "name": "HyenaEnhancer (Project/Paper)",
      "highlights": [
        "Adapted a Large Language Models (LLM) to predict the functional activity of enhancer sequences", 
        "Conducted a comparative analysis of LLM against Convolutional Neural Networks (CNN) for enhancer prediction, exploring the advantages and limitations of each"
      ],
      "startDate": "2024-01",
      "endDate": "Present"
    },
    {
      "name": "Student Record System (Project)",
      "highlights": [
        "Designed and implemented a three-tier architecture framework utilizing a MySQL database for efficient management of student data, including class schedule and personal information", 
        "Ensured data persistence through MyBatis and integrated web functionalities using Jakarta Servlet"
      ],
      "startDate": "2023-05",
      "endDate": "2023-06",
      "url": "https://github.com/HurleyQi/student-record-system"
    }
  ]
}
